app/controllers/api/v1/users_controller.rb

    def create
        user = User.find_or_create_by(username: params[:username])
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Dwayne"], ["created_at", "2022-12-06 23:12:12.965754"], ["updated_at", "2022-12-06 23:12:12.965754"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Leonor"], ["LIMIT", 1]]

    def update
        ub = UserBook.find_by(user_id: params[:id], book_id: params[:book_id])
        if ub.destroy
            book = Book.find(params[:book_id])
---
SELECT "user_books".* FROM "user_books" WHERE "user_books"."user_id" = ? AND "user_books"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 35], ["LIMIT", 1]]
DELETE FROM "user_books" WHERE "user_books"."id" = ?  [["id", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]