app/controllers/api/v1/user_books_controller.rb

    def create
        ub = UserBook.new(user_id: params[:user_id], book_id: params[:book_id])
        if ub.save
            book = Book.find(params[:book_id])
---
INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 77], ["created_at", "2022-12-06 07:37:18.076961"], ["updated_at", "2022-12-06 07:37:18.076961"]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 77], ["LIMIT", 1]]